app/Http/Controllers/ClientController.php

select * from `clients`
select * from `users` where `users`.`id` in (2, 3)
---
    public function datatables()
    {
        $clients = Client::with('user')->get();

select * from `clients`
select * from `users` where `users`.`id` in (2, 3)
select `firstname`, `id` from `users` order by `firstname` asc
---
    public function index()
    {
        $clients = Client::with('user')->get();
        $users = User::all()->pluck('id', 'firstname')->toArray();

select * from `users`
---
    public function create()
    {
        $users = User::all();

insert into `clients` (`numb_cli`, `nom`, `prenom`, `first_phone`, `second_phone`, `date_naiss`, `numb_cnib`, `genre`, `status`, `user_id`, `updated_at`, `created_at`) values ('In in eligendi error', 'Aspernatur recusanda', 'Quisquam provident', '+1 (175) 142-7989', '+1 (754) 372-1627', '1978-06-12', 'Ullam velit sit ut', 'masculin', 'accept', '3', '2022-09-08 19:41:52', '2022-09-08 19:41:52')
---
        // $client->created_by = Auth::id();
        // $client->updated_by = Auth::id();

        $client->save();